app/controllers/bairros_controller.rb

SELECT * FROM `bairros`
---
  def index
    @bairros = Bairro.all

SELECT * FROM `bairros` WHERE (`bairros`.`id` = 1)
---
  def show
    @bairro = Bairro.find(params[:id])

SELECT * FROM `bairros` WHERE (`bairros`.`id` = 1)
---
  def edit
    @bairro = Bairro.find(params[:id])

INSERT INTO `bairros` (`respcad`, `created_at`, `updated_at`, `bairro`, `respmod`, `estado`, `cidade`) VALUES(NULL, '2010-01-14 22:38:15', '2010-01-14 22:38:15', 'TIROL', NULL, 'RN', 'NATAL')
---
  def create
    @bairro = Bairro.new(params[:bairro])
    @title = "BAIRROS - INCLUSÃO"

    respond_to do |format|
      if @bairro.save

SELECT `bairros`.id FROM `bairros` WHERE (`bairros`.`bairro` = BINARY 'TIROL' AND `bairros`.id <> 1) LIMIT 1
UPDATE `bairros` SET `updated_at` = '2010-01-20 17:33:12', `respmod` = 'SUPERVISOR' WHERE `id` = 1
---
  def update
    @bairro = Bairro.find(params[:id])
    @title = "BAIRROS - ALTERAÇÃO"

    respond_to do |format|
      if @bairro.update_attributes(params[:bairro])

SELECT * FROM `bairros` WHERE (`bairros`.`id` = 3)
DELETE FROM `bairros` WHERE `id` = 3
---
  def destroy
    @bairro = Bairro.find(params[:id])
    @bairro.destroy