app/controllers/congregacoes_controller.rb

SELECT * FROM `congregacoes`
---
  def index
    @congregacoes = Congregacoes.all

SELECT * FROM `congregacoes` WHERE (`congregacoes`.`id` = 1)
---
  def show
    @congregacoes = Congregacoes.find(params[:id])

SELECT * FROM `congregacoes` WHERE (`congregacoes`.`id` = 1)
---
  def edit
    @congregacoes = Congregacoes.find(params[:id])

INSERT INTO `congregacoes` (`endereco`, `respcad`, `telefone`, `data_fundacao`, `created_at`, `nome`, `cep`, `updated_at`, `bairro`, `respmod`, `estado`, `cidade`, `igreja_id`) VALUES('', '', NULL, '2010-01-15', '2010-01-15 00:07:10', 'Testando', NULL, '2010-01-15 00:07:10', '', '', '', '', 1)
---
  def create
    @congregacoes = Congregacoes.new(params[:congregacoes])
    @title = "Cadastro de Congregração"
    respond_to do |format|
      if @congregacoes.save

SELECT * FROM `congregacoes` WHERE (`congregacoes`.`id` = 1)
UPDATE `congregacoes` SET `updated_at` = '2010-01-20 17:42:31', `estado` = 'RN', `bairro` = 'TIROL', `cidade` = 'NATAL' WHERE `id` = 1
---
  def update
    @congregacoes = Congregacoes.find(params[:id])
    @title = "Edição da Congregação: " + @congregacoes.nome
    respond_to do |format|
      if @congregacoes.update_attributes(params[:congregacoes])

SELECT * FROM `congregacoes` WHERE (`congregacoes`.`id` = 3)
DELETE FROM `congregacoes` WHERE `id` = 3
---
  def destroy
    @congregacoes = Congregacoes.find(params[:id])
    @congregacoes.destroy