app/controllers/igrejas_controller.rb

SELECT * FROM `igrejas`
---
  def index
  	@igrejas = Igreja.all

SELECT * FROM `igrejas` WHERE (`igrejas`.`id` = 1)
---
  def show
    @igreja = Igreja.find(params[:id])

INSERT INTO `igrejas` (`endereco`, `logotipo`, `respcad`, `telefone`, `created_at`, `sinodo`, `cep`, `updated_at`, `cnpj`, `data_organizao`, `logotipo_relatiorios`, `bairro`, `respmod`, `razao_social`, `estado`, `cidade`, `presbiterio`) VALUES('teste', x'', 'teste', 'teste', '2010-01-14 23:55:26', 'teste', 'teste', '2010-01-14 23:55:26', 1234567890, '2010-01-14', x'', 'teste', '', 'Teste', 'teste', 'teste', 'teste')
---
  def create
    @igreja = Igreja.new(params[:igreja])

    respond_to do |format|
      if @igreja.save