app/controllers/membros_controller.rb

SELECT * FROM `membros`
---
  def index
    @membros = Membro.all