app/controllers/ministerios_controller.rb

SELECT * FROM `ministerios`
---
  def index
    @ministerios = Ministerios.all

SELECT * FROM `ministerios` WHERE (`ministerios`.`id` = 1)
---
  def show
    @ministerios = Ministerios.find(params[:id])

SELECT * FROM `ministerios` WHERE (`ministerios`.`id` = 1)
---
  def edit
    @ministerios = Ministerios.find(params[:id])

INSERT INTO `ministerios` (`respcad`, `created_at`, `nome`, `updated_at`, `congregacao_id`, `respmod`, `objetivo`) VALUES('testando', '2010-01-15 16:55:05', 'Ministério de Louvor', '2010-01-15 16:55:05', 1, 'testando', 'Testando')
---
  def create
    @ministerios = Ministerios.new(params[:ministerios])
    @title = "Cadastro de Ministério"
    respond_to do |format|
      if @ministerios.save

SELECT * FROM `ministerios` WHERE (`ministerios`.`id` = 4)
UPDATE `ministerios` SET `updated_at` = '2010-01-17 15:10:07', `igreja_id` = 1 WHERE `id` = 4
---
  def update
    @ministerios = Ministerios.find(params[:id])
    @title = "Edição do Ministério: " + @ministerios.nome
    respond_to do |format|
      if @ministerios.update_attributes(params[:ministerios])

SELECT * FROM `ministerios` WHERE (`ministerios`.`id` = 1)
DELETE FROM `ministerios` WHERE `id` = 1
---
  def destroy
    @ministerios = Ministerios.find(params[:id])
    @ministerios.destroy