app/controllers/usuarios_controller.rb

INSERT INTO `usuarios` (`salt`, `respcad`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `respmod`, `login`, `email`) VALUES('edaff765cbfcbcc82dd6abbbe0692f3a41f8465d', NULL, '2010-01-20 17:55:36', 'ec104f3178b97a11bcba0816f99aa9d1cd6520ed', NULL, '2010-01-20 17:55:36', NULL, NULL, 'marcosbarros', 'marcosbarros@digizap.com.br')
SELECT `usuarios`.id FROM `usuarios` WHERE (LOWER(`usuarios`.`login`) = BINARY 'marcosbarros' AND `usuarios`.id <> 4) LIMIT 1
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @usuarios = Usuarios.new(params[:usuarios])
    @usuarios.save
    Usuarios.update(@usuarios.id, :respcad => self.current_usuarios.login.upcase)
    if @usuarios.errors.empty?